oldprogram/nRF51822/1.77_spi_lcd_&&_flash/arm/include/ble_gatts.h
/**@brief Event structure for BLE_GATTS_EVT_MTU_UPDATE. */
typedef struct
{
  uint16_t          att_mtu;                      /**< Negotiated MTU. */
} ble_gatts_evt_mtu_update_t;


/**@brief Event structure for BLE_GATTS_EVT_WRITE. */
typedef struct
{
  uint16_t                    handle;             /**< Attribute Handle. */
  uint8_t                     op;                 /**< Type of write operation, see @ref BLE_GATTS_OPS. */
  ble_gatts_attr_context_t    context;            /**< Attribute Context. */
  uint16_t                    offset;             /**< Offset for the write operation. */
  uint16_t                    len;                /**< Length of the incoming data. */
  uint8_t                     data[1];            /**< Incoming data, variable length */
} ble_gatts_evt_write_t;

/**@brief Event structure for authorize read request. */
typedef struct
{
  uint16_t                    handle;             /**< Attribute Handle. */
  ble_gatts_attr_context_t    context;            /**< Attribute Context. */
  uint16_t                    offset;             /**< Offset for the read operation. */
} ble_gatts_evt_read_t;

/**@brief Event structure for BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST. */
typedef struct
{
  uint8_t                     type;             /**< Type of authorize operation, see @ref BLE_GATTS_AUTHORIZE_TYPES. */
  union {
    ble_gatts_evt_read_t      read;             /**< Attribute Read Parameters */
    ble_gatts_evt_write_t     write;            /**< Attribute Write Parameters */
  } request;
} ble_gatts_evt_rw_authorize_request_t;

/**@brief Event structure for BLE_GATTS_EVT_SYS_ATTR_MISSING. */
typedef struct
{
  uint8_t hint;
} ble_gatts_evt_sys_attr_missing_t;


/**@brief Event structure for BLE_GATTS_EVT_HVC. */
typedef struct
{
  uint16_t          handle;                       /**< Attribute Handle. */
} ble_gatts_evt_hvc_t;

/**@brief Event structure for BLE_GATTS_EVT_TIMEOUT. */
typedef struct
{
  uint8_t          src;                       /**< Timeout source, see @ref BLE_GATT_TIMEOUT_SOURCES. */
} ble_gatts_evt_timeout_t;


/**@brief GATT Server event callback event structure. */
typedef struct
{
  uint16_t conn_handle;                                       /**< Connection Handle on which event occurred. */
  union
  {
    ble_gatts_evt_mtu_update_t            mtu_update;         /**< MTU Update Event Parameters. */
    ble_gatts_evt_write_t                 write;              /**< Write Event Parameters. */
    ble_gatts_evt_rw_authorize_request_t  authorize_request;  /**< Read or Write Authorize Request Parameters. */
    ble_gatts_evt_sys_attr_missing_t      sys_attr_missing;   /**< System attributes missing. */
    ble_gatts_evt_hvc_t                   hvc;                /**< Handle Value Confirmation Event Parameters. */
    ble_gatts_evt_timeout_t               timeout;            /**< Timeout Event. */
  } params;
} ble_gatts_evt_t;


/**@brief Load a preconfigured GATT attribute database.
 * @note Not yet implemented.
 *
 * @param[in] len    Length in bytes of the buffer data.
 * @param[in] p_data Pointer to the beginning of the buffer containing the raw database data.
 * @return @ref NRF_ERROR_NOT_SUPPORTED
 *
 */
SVCALL(SVC_BLE_GATTS_DB_LOAD, uint32_t, ble_gatts_db_load(uint32_t len, uint8_t const* const p_data));


/**@brief Add a service declaration to the local server database.
 *
 * @note The Service Changed characteristic is currently not implemented. Thus, to conform to the 
 *       Blutetooth specifications, the application must not add, modify or remove services, 
 *       characteristics or descriptors while the device is connected or bonded to another device.
 *
 * @param[in] type      Toggles between primary and secondary services, see @ref BLE_GATTS_SRVC_TYPES.
 * @param[in] p_uuid    Pointer to service UUID.
 * @param[out] p_handle Pointer to a 16-bit word where the assigned handle will be stored.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_FORBIDDEN Forbidden value supplied.
 * @return @ref NRF_ERROR_NO_MEM Not enough memory to complete operation.
 */
SVCALL(SVC_BLE_GATTS_SERVICE_ADD, uint32_t, ble_gatts_service_add(uint8_t type, ble_uuid_t const*const p_uuid, uint16_t *const p_handle));


/**@brief Add an include declaration to the local server database.
 *
 * @note The Service Changed characteristic is currently not implemented. Thus, to conform to the 
 *       Blutetooth specifications, the application must not add, modify or remove services, 
 *       characteristics or descriptors while the device is connected or bonded to another device.
 *
 * @param[in] service_handle    Handle of the service where the included service is to be placed, if BLE_GATT_HANDLE_INVALID is used, it will be placed sequentially.
 * @param[in] inc_srvc_handle    Handle of the included service.
 * @param[out] p_include_handle Pointer to a 16-bit word where the assigned handle will be stored.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_INVALID_STATE Invalid state to perform operation.
 * @return @ref NRF_ERROR_FORBIDDEN Forbidden value supplied.
 * @return @ref NRF_ERROR_NO_MEM Not enough memory to complete operation.
 * @return @ref NRF_ERROR_NOT_FOUND Attribute not found.
 */
SVCALL(SVC_BLE_GATTS_INCLUDE_ADD, uint32_t, ble_gatts_include_add(uint16_t service_handle, uint16_t inc_srvc_handle, uint16_t *const p_include_handle));


/**@brief Add a characteristic declaration, a characteristic value declaration and optional characteristic descriptor declarations to the local server database.
 *
 * @note The Service Changed characteristic is currently not implemented. Thus, to conform to the 
 *       Blutetooth specifications, the application must not add, modify or remove services, 
 *       characteristics or descriptors while the device is connected or bonded to another device.
 *
 * @param[in] service_handle    Handle of the service where the characteristic is to be placed, if BLE_GATT_HANDLE_INVALID is used, it will be placed sequentially.
 * @param[in] p_char_md         Characteristic metadata.
 * @param[in] p_attr_char_value Pointer to the attribute structure corresponding to the characteristic value.
 * @param[out] p_handles        Pointer to the structure where the assigned handles will be stored.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_INVALID_STATE Invalid state to perform operation.
 * @return @ref NRF_ERROR_FORBIDDEN Forbidden value supplied.
 * @return @ref NRF_ERROR_NO_MEM Not enough memory to complete operation.
 * @return @ref NRF_ERROR_DATA_SIZE Invalid data size(s) supplied.
 */
SVCALL(SVC_BLE_GATTS_CHARACTERISTIC_ADD, uint32_t, ble_gatts_characteristic_add(uint16_t service_handle, ble_gatts_char_md_t const*const p_char_md, ble_gatts_attr_t const*const p_attr_char_value, ble_gatts_char_handles_t *const p_handles));


/**@brief Add a descriptor to the local server database.
 *
 * @note The Service Changed characteristic is currently not implemented. Thus, to conform to the 
 *       Blutetooth specifications, the application must not add, modify or remove services, 
 *       characteristics or descriptors while the device is connected or bonded to another device.
 *
 * @param[in] char_handle   Handle of the characteristic where the descriptor is to be placed, if BLE_GATT_HANDLE_INVALID is used, it will be placed sequentially.
 * @param[in] p_attr        Pointer to the attribute structure.
 * @param[out] p_handle     Pointer to a 16-bit word where the assigned handle will be stored.
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_INVALID_STATE Invalid state to perform operation.
 * @return @ref NRF_ERROR_FORBIDDEN Forbidden value supplied.
 * @return @ref NRF_ERROR_NO_MEM Not enough memory to complete operation.
 * @return @ref NRF_ERROR_DATA_SIZE Invalid data size(s) supplied.
 */
SVCALL(SVC_BLE_GATTS_DESCRIPTOR_ADD, uint32_t, ble_gatts_descriptor_add(uint16_t char_handle, ble_gatts_attr_t const * const p_attr, uint16_t* const p_handle));

/**@brief Set the metadata for a given attribute.
 *
 * @param[in] handle    Attribute handle.
 * @param[in] p_attr_md Pointer to the desired attribute metadata.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_NOT_FOUND Attribute not found.
 */
SVCALL(SVC_BLE_GATTS_MD_SET, uint32_t, ble_gatts_md_set(uint16_t handle, ble_gatts_attr_md_t const * const p_attr_md));

/**@brief Get the metadata for a given attribute.
 *
 * @param[in] handle     Attribute handle.
 * @param[out] p_attr_md Pointer to the structure to be filled in with data.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_NOT_FOUND Attribute not found.
 */
SVCALL(SVC_BLE_GATTS_MD_GET, uint32_t, ble_gatts_md_get(uint16_t handle, ble_gatts_attr_md_t* const p_attr_md));

/**@brief Set the value of a given attribute.
 *
 * @note The Service Changed characteristic is currently not implemented. Thus, to conform to the 
 *       Blutetooth specifications, the application must not add, modify or remove services, 
 *       characteristics or descriptors while the device is connected or bonded to another device.
 *
 * @param[in] handle    Attribute handle.
 * @param[in] offset    Offset in bytes to write from.
 * @param[in,out] p_len Length in bytes to be written, length in bytes written after successful return.
 * @param[in] p_value   Pointer to a buffer (at least len bytes long) containing the desired attribute value.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref NRF_ERROR_NOT_FOUND Attribute not found.
 * @return @ref NRF_ERROR_DATA_SIZE Invalid data size(s) supplied.
 */
SVCALL(SVC_BLE_GATTS_VALUE_SET, uint32_t, ble_gatts_value_set(uint16_t handle, uint16_t offset, uint16_t* const p_len, uint8_t const * const p_value));

