oldprogram/nRF51822/1.77_spi_lcd_&&_flash/arm/include/ble_gatts.h
/**@brief Get the value of a given attribute.
 *
 * @param[in] handle     Attribute handle.
 * @param[in] offset     Offset in bytes to read from.
 * @param[in,out] p_len  Length in bytes to be read, length in bytes read after successful return.
 * @param[in,out] p_data Pointer to a buffer (at least len bytes long) where to store the attribute value.
 * 
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_NOT_FOUND Attribute not found.
 */
SVCALL(SVC_BLE_GATTS_VALUE_GET, uint32_t, ble_gatts_value_get(uint16_t handle, uint16_t offset, uint16_t *const p_len, uint8_t* const p_data));

/**@brief Notify or Indicate an attribute value.
 *
 * @details This function checks for the relevant Client Characteristic Configuration descriptor value to verify that the relevant operation
 *          (notification or indication) has been enabled by the client. It is also able to update the attribute value before issuing the PDU, so that
 *          the application can atomically perform a value update and a server initiated transaction with a single API call.
 *          If the application chooses to indicate an attribute value, a @ref BLE_GATTS_EVT_HVC will be sent up as soon as the confirmation arrives from
 *          the peer.
 *
 * @note    The local attribute value may be updated even if an outgoing packet is not sent to the peer due to an error during execution. 
 *          When receiveing the error codes @ref NRF_ERROR_INVALID_STATE, @ref NRF_ERROR_BUSY, @ref BLE_ERROR_GATTS_SYS_ATTR_MISSING and 
 *          @ref BLE_ERROR_NO_TX_BUFFERS the database has been updated.
 *          The caller can check whether the value has been updated by looking at the contents of *(p_hvx_params->p_len).
 *
 * @note    It is important to note that a notification will <b>consume an application buffer</b>, and will therefore 
 *          generate a @ref BLE_EVT_TX_COMPLETE event when the packet has been transmitted. An indication on the other hand will use the 
 *          standard server internal buffer and thus will only generate a @ref BLE_GATTS_EVT_HVC event as soon as the confirmation 
 *          has been received from the peer.
 *
 * @param[in] conn_handle  Connection handle.
 * @param[in] p_hvx_params Pointer to an HVx parameters structure. If the p_data member contains a non-NULL pointer the attribute value will be updated with
 *                         the contents pointed by it before sending the notification or indication.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref BLE_ERROR_INVALID_ATTR_HANDLE Invalid attribute handle(s) supplied.
 * @return @ref BLE_ERROR_GATTS_INVALID_ATTR_TYPE Invalid attribute type(s) supplied.
 * @return @ref NRF_ERROR_NOT_FOUND Attribute not found.
 * @return @ref NRF_ERROR_DATA_SIZE Invalid data size(s) supplied.
 * @return @ref NRF_ERROR_INVALID_STATE Invalid state to perform operation.
 * @return @ref NRF_ERROR_BUSY Procedure already in progress.
 * @return @ref BLE_ERROR_GATTS_SYS_ATTR_MISSING System attributes missing.
 * @return @ref BLE_ERROR_NO_TX_BUFFERS There are no available buffers to send the data.
 */
SVCALL(SVC_BLE_GATTS_HVX, uint32_t, ble_gatts_hvx(uint16_t conn_handle, ble_gatts_hvx_params_t const*const p_hvx_params));

/**@brief Indicate the Service Changed attribute value.
 *
 * @details This call will send a Handle Value Indication to one or more peers connected to inform them that the attribute
 *          table layout has changed. As soon as the peer has confirmed the indication, a @ref BLE_GATTS_EVT_SC_CONFIRM event will
 *          be issued.
 *
 * @note    Some of the restrictions and limitations that apply to @ref ble_gatts_hvx also apply here.
 *
 * @param[in] conn_handle  Connection handle.
 * @param[in] start_handle Start of affected attribute handle range.
 * @param[in] end_handle   End of affected attribute handle range.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref BLE_ERROR_INVALID_CONN_HANDLE Invalid Connection Handle
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_INVALID_PARAM Invalid parameter(s) supplied.
 * @return @ref BLE_ERROR_INVALID_ATTR_HANDLE Invalid attribute handle(s) supplied.
 * @return @ref NRF_ERROR_INVALID_STATE Invalid state to perform operation.
 * @return @ref NRF_ERROR_BUSY Procedure already in progress.
 * @return @ref BLE_ERROR_GATTS_SYS_ATTR_MISSING System attributes missing.
 */
SVCALL(SVC_BLE_GATTS_SERVICE_CHANGED, uint32_t, ble_gatts_service_changed(uint16_t conn_handle, uint16_t start_handle, uint16_t end_handle));

/**@brief Respond to a Read/Write authorization request.
 *
 * @param[in] conn_handle                 Connection handle.
 * @param[in] p_rw_authorize_reply_params Pointer to a structure with the attribute provided by the application.
 *
 * @return @ref NRF_SUCCESS               Success.
 * @return @ref NRF_ERROR_INVALID_STATE   No authorization request pending.
 * @return @ref NRF_ERROR_INVALID_PARAM   Authorization op invalid,
 *                                         or for Read Authorization reply: requested handles not replied with,
 *                                         or for Write Authorization reply: handle supplied does not match requested handle.
 */
SVCALL(SVC_BLE_GATTS_RW_AUTHORIZE_REPLY, uint32_t, ble_gatts_rw_authorize_reply(uint16_t conn_handle, ble_gatts_rw_authorize_reply_params_t const*const p_rw_authorize_reply_params));


/**@brief Update persistent system attribute info
 *
 * @details Supply to the stack information about persistent system attributes.
 *          This call is legal in the connected state only, and is usually 
 *          made immediately after a connection is established and the bond identified.
 *          usually as a response to a BLE_GATTS_EVT_SYS_ATTR_MISSING.
 *
 *          p_sysattrs may point directly to the application's flashed copy of the struct.
 *          If the pointer is NULL, the system attribute info is initialized, assuming that
 *          the application does not have any previously saved data for this bond.
 *
 * @note The state of persistent attributes is reset upon connection and then remembered for its duration. 
 *       This means that invoking this call for a second time during a connection will have no effect upon the values of the attributes.
 *
 * @param[in]  conn_handle     Connection handle.
 * @param[in]  p_sys_attr_data     Pointer to a saved copy of system attributes supplied to the stack, or NULL.
 * @param[in]  len Size of data pointed by p_sys_attr_data, in octets. 
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_DATA Invalid data type(s) supplied.
 * @return @ref NRF_ERROR_NO_MEM Not enough memory to complete operation.
 */ 
SVCALL(SVC_BLE_GATTS_SYS_ATTR_SET, uint32_t, ble_gatts_sys_attr_set(uint16_t conn_handle, uint8_t const*const p_sys_attr_data, uint16_t len)); 

 
 /**@brief Retrieve persistent system attribute info from softdevice
 *
 * @details This call is used to retrieve information about values to be stored perisistently by the application
 *          after a connection has been terminated. When a new connection is made to the same bond, the values
 *          should be restored using ble_gatts_sys_attr_set().
 *          The data should be read before any new advertising is started, or any new connection established. The connection handle for
 *          the previous now defunct connection will remain valid until a new one is created to allow this API call to refer to it.
 *
 * @param[in]     conn_handle      Connection handle of the recently terminated connection.
 * @param[in]     p_sys_attr_data  Pointer to a buffer where updated information about system attributes will be filled in. NULL can be provided to 
 *                                 obtain the length of the data
 * @param[in,out] p_len  Size of application buffer if p_sys_attr_data is not NULL. Unconditially updated to actual length of system attribute data.
 *
 * @return @ref NRF_SUCCESS Success.
 * @return @ref NRF_ERROR_INVALID_ADDR Invalid pointer supplied.
 * @return @ref NRF_ERROR_DATA_SIZE Invalid data size(s) supplied.
 */ 
SVCALL(SVC_BLE_GATTS_SYS_ATTR_GET, uint32_t, ble_gatts_sys_attr_get(uint16_t conn_handle, uint8_t * const p_sys_attr_data, uint16_t* const p_len)); 


#endif // BLE_GATTS_H__

/**
  @}
*/
